#6.В кортеже целых чисел найдите максимальный и минимальный элементы.
print()
my_tuple = (1, 3, 5, 7, 345, 876, -65, -6, 678, 564)
print(f"Кортеж целых чисел: {my_tuple}")
print()
min_element = min(my_tuple)
max_element = max(my_tuple)
print(f"Максимальный элемент кортежа: {max_element}")
print(f"Минимальный элемент кортежа: {min_element}")